/********************************************************************************************
	文件: beep.c
	作者: WillJason
	版本：V1.0
	备注：这个文件提供了蜂鸣器的函数库  	   
*********************************************************************************************/
#include "STC12C5A60S2.h"
#include "Ps2_Int.h"
#include "io_config.h"
#include "uart.h"
#include "global.h"
#include "beep.h"

/********************************************************************************************
	函数功能：有效按键蜂鸣器
	入口参数：无 
	返回参数：无
	函数说明：提供玩家按下有效按键时的蜂鸣声，用来表示密码，按下按键蜂鸣1声（100ms）
********************************************************************************************/
void Other_Beep(void)									  
{
	beep_port = 1;delay_ms(100);beep_port = 0;			  //按键蜂鸣1声（100ms）
}
/********************************************************************************************
	函数功能：回车键蜂鸣器
	入口参数：无 
	返回参数：无
	函数说明：回车键：用来确定输入，输入密码后必须按下回车键确认。按下回车键后蜂鸣2声（响100ms、停50ms、响100ms）；
********************************************************************************************/
void Enter_Beep(void)
{
	beep_port = 1;										  //蜂鸣2声（响100ms、停50ms、响100ms）
	delay_ms(100);
	beep_port = 0;
	delay_ms(50);
	beep_port = 1;
	delay_ms(100);
	beep_port = 0;
}
/********************************************************************************************
	函数功能：回格键蜂鸣器
	入口参数：无 
	返回参数：无
	函数说明：回格键：用来清除所有输入。按下回格键后蜂鸣2声（响100ms、停50ms、响100ms）；
********************************************************************************************/
void Backspace_Beep(void)
{
	beep_port = 1;										  //蜂鸣2声（响100ms、停50ms、响100ms）
	delay_ms(100);
	beep_port = 0;
	delay_ms(50);
	beep_port = 1;
	delay_ms(100);
	beep_port = 0;
}
