/************************************************************************************       
	文件: main.c
	作者: WillJason
	版本：V1.0
	备注：主函数体 	   
*************************************************************************************/
#include "STC12C5A60S2.h"
#include "yx5200.h"
#include "key.h"
#include "uart.h"
#include "global.h"
#include "io_config.h"
#include "Ps2_Int.h"
#include "timer.h"

#define start_30s 1
/******************************************************************************************
	函数功能：系统端口和芯片初始化函数
	入口参数：无
	返回参数：无	
	函数说明：将用到的系统端口进行初始化，使电路板硬件进入稳定的状态
*******************************************************************************************/
void SysPort_Init(void)
{
	P4M0 |= 0x01;				 					      //P4M0是0，P4M1是1为端口输入模式；反之为推挽输出模式
	P4M1 &= ~0x01;
	led_port = 0;									      //控制D1灯，高电平灯亮。灭？
	beep_port = 0;									      //控制蜂鸣器，高电平蜂鸣器工作
	delay_ms(1500);					      			      //上电延后时1.5s，让yx5200芯片稳定
	led_port = 1;									      //标志MP3芯片进入稳定状态	   可当做调试使用，判断是否稳定完成
	relay_port= 1;									      //门锁初始化为上锁状态
	Ps2_Data  = 1;									      //Ps2键盘数据的读取端口初始化为高电平
}
/******************************************************************************************
	函数功能：主函数
	入口参数：无
	返回参数：无	
	函数说明：
*******************************************************************************************/
void main()
{ 	
	SysPort_Init();
	uart1_init();
	IT1 = 1;  										      //设外部中断1为下降沿触发
	EX1=1;    										      //开中断 1
	EA = 1;   										      //开总中断 
	Play_Set_Sound(0x0201);							      //播放音频02-001.mp3（键盘机关已启动）
	Ps2_Out_Free();										  //将中断服务函数中的变量清零，以准备接收之后输入的键值
	timer0_init();										  //初始化定时器0，后面开始30s内会用到，后面判断连续10s内输入用到
	TR0=1;									      		  //启动定时器，启动30s计时							     
	music.folder_num =0x0102;		  				      //初始为0x0102,后面输入密码正确后与0x0103进行异或运算来实现开锁和关锁的切换
	while(1)
	{
		  Player_Set_Password();						  //配置密码用，当配置密码标志位有效时进行密码配置
		  Send_Analysis();						          //发送从键盘得到的按键码数据并操作函数（接收、保存密码、解码实现相应的功能）
		  Gain_Key_Data();								  //判断键值是否有效
		  Determine_10s();							      //判断连续的10秒内是否有输入
	}	
}



	
