/********************************************************************************************
	ÎÄ¼ş: Ps2_Int.c
	×÷Õß: WillJason
	°æ±¾£ºV1.0
	±¸×¢£ºÕâ¸öÎÄ¼şÌá¹©ÁËÍâ²¿ÖĞ¶ÏºÍ±àÂë´¦ÀíµÄº¯Êı¿â  	   
*********************************************************************************************/
#include "STC12C5A60S2.h"
#include "Ps2_Int.h"
#include "io_config.h"
#include "uart.h"
#include "global.h"
#include "beep.h"
#include "yx5200.h"
#include "timer.h"
#include "iap.h"

uint8_t xdata Password_Buf[80]=0;						  //Íæ¼Ò»òÅäÖÃÃÜÂëÈËÔ±ÊäÈëµÄÃÜÂë
uint8_t xdata Saved_Password_Buf[60]=0;		              //ÅäÖÃºÃµÄÃÜÂë
uint8_t xdata Read_Password_Buf[60]=0;		              //ÅäÖÃºÃµÄÃÜÂë
uint8_t xdata Administrator[12]={0x1B,0x23,0x1C,0x3A,0x72,0x45,0x16,0x36,0x45,0x16,0x16,0x36};	//½øÈëÅäÖÃ³ÌĞòÃÜÂësdam20160116

bit Gain_New=0;								  //½ÓÊÕµ½ĞÂµÄ¼üÂëÊı¾İ±êÖ¾Î»
bit Key_Up = 1;								  //ÅĞ¶Ï°´¼üÊÇ·ñËÉ¿ª±êÖ¾Î»
bit Over_Flag = 0;							  //

/********************************************************************************************
	º¯Êı¹¦ÄÜ£º·¢ËÍ´Ó¼üÅÌµÃµ½µÄ°´¼üÂëÊı¾İ£»µ÷ÓÃ²Ù×÷º¯Êı
	Èë¿Ú²ÎÊı£ºÎŞ 
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£ºÅĞ¶Ï°´¼üµÄ×Ö·ûÊÇ·ñÊäÈëÍê±Ï£¬ÊäÈëÍê±Ï½«¼üÖµÊı¾İÍ¨¹ı´®¿Ú·¢ËÍÉÏÎ»»ú¡£
********************************************************************************************/
void Send_Analysis(void)
{														  
	if(BF != 0)											  //½ÓÊÕµ½ÁËÒ»¸ö¼üµÄ¼üÂë
	{
		BF=0;
		//uart1_send_byte(0x33);						  //µ÷ÊÔÓÃ
		uart1_send_byte(Key_Data);
		Password_Input(Key_Data);				          //µ÷ÓÃ²Ù×÷º¯Êı£¨½ÓÊÕ¡¢±£´æÃÜÂë¡¢½âÂëÊµÏÖÏàÓ¦µÄ¹¦ÄÜ£©		
	}
}
/********************************************************************************************
	º¯Êı¹¦ÄÜ£º°´¼üÖĞ¶Ï´¦Àíº¯Êı
	Èë¿Ú²ÎÊı£ºÎŞ 
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£º»ñµÃ¼üÖµ²¢½«½«¼üÖµ´æÈë²ÎÊı±äÁ¿¡£Ã¿°´Ò»¸ö¼ü»á²úÉúÈçÏÂÊı¾İ£¬°´ÏÂ²úÉúÒ»×é´®ĞĞÊı¾İ£¬ËÉ¿ª²úÉúÁ½×é´®ĞĞÊı¾İ
			  µÚÒ»Î»ÎªÆğÊ¼Î»0
			  µÚ¶şÎ»~µÚ¾ÅÎ»ÎªÊı¾İÎ»£¨¼´É¨ÃèÂë£©£¬µÍÎ»¿ªÊ¼´«Êä
			  µÚÊ®Î»ÆæÅ¼Ğ£ÑéÎ»¡£Èç¹ûÉ¨ÃèÂëÖĞ1µÄ¸öÊıÎªÆæÊı£¬¸ÃÎ»È¡0£¬Èç¹ûÉ¨ÃèÂëÖĞ1µÄ¸öÊıÎªÅ¼Êı£¬¸ÃÎ»È¡1
			  µÚÊ®Ò»Î»½áÊøÎ»£¬¸ßµçÆ½¡£
			  µ±¼üÅÌ·¢ËÍÊı¾İÊ±£¬¼üÅÌÏÈ½«DATA À­µÍ£¬Í¨ÖªÖ÷»ú×¼±¸½ÓÊÕÊı¾İ¡£¼üÅÌÔÚCLKÎª¸ßµçÆ½Ê±½¨Á¢Êı¾İ£¬Ö÷»úÔÚCLKÎªµÍ
			  µçÆ½Ê±¶ÁÈ¡Êı¾İ¡£·¢ËÍÊı¾İµÄÊ±ÖÓĞÅºÅÓÉ¼üÅÌ²úÉú¡£
********************************************************************************************/
void Ps2_Out(void) interrupt 2                            //¼üÅÌÖĞ¶Ï´¦Àí ¼üÖµ´æ´¢ÔÚ KeyV ÖĞ
{
	
	if ((IntNum>0) && (IntNum <9))						  //È¡³öµÚ¶şÎ»µ½µÚ¾ÅÎ»×Ü¹²Ò»¸ö×Ö½ÚµÄÊı¾İ£¬µÚÒ»Î»ÎªÆğÊ¼Î»
	{			
		KeyV = KeyV >> 1;                                 //Òò¼üÅÌÊı¾İÊÇµÍ>>¸ß£¬½áºÏÉÏÒ»¾äËùÒÔÓÒÒÆÒ»Î»
		if (Ps2_Data != 0)                                  //µ±¼üÅÌÊı¾İÏßÎª1Ê±   
		{KeyV = KeyV | 0x80;}                             //´æ´¢Ò»Î»
	}
	IntNum++;                                             //ÖĞ¶Ï´ÎÊı¼ÓÒ»(ÖĞ¶ÏÒ»´Î½ÓÊÕÒ»Î»Êı¾İ)
	if (IntNum > 10)                                      //ÖĞ¶Ï11´ÎºóÊı¾İ·¢ËÍÍê±Ï
	{   
		IntNum = 0;                                       //µ±ÖĞ¶Ï11´Îºó±íÊ¾Ò»Ö¡Êı¾İÊÕÍê£¬Çå±äÁ¿×¼±¸ÏÂÒ»´Î½ÓÊÕ
		led_port = ~led_port;							  //µ÷ÊÔÓÃ
		/*********************Êı¾İ´¦Àí*********************/
		Make_Code=KeyV;									  //½ÓÊÕµ½µÄ¼üÅÌÂë£ºÍ¨Âë£¬¶ÏÂë0xF0£¬µÈµÈ£¨ÕâÀï½öÆğÁË¸öÍ¨ÂëMake_CodeµÄÃû×Ö¶øÒÑ£©
		if(Make_Code == 0xF0)							  //Èç¹û½ÓÊÕµ½0xF0£¬µ¥¶ÀÁô×¡£¬È·¶¨ÊÕµ½0xF0
		{
			isCode_F0=Make_Code;						  //¶ÏÂëµÚÒ»Î»Êı¾İ0xF0±£´æ
		}
		//uart1_send_byte(Make_Code);					  //µ÷ÊÔÓÃ
		Gain_New=1;										  //½ÓÊÕµ½ĞÂµÄ×Ö½ÚµÄÊı¾İ±êÖ¾
	}	 							 	
}
/********************************************************************************************
	º¯Êı¹¦ÄÜ£ºÍâ²¿ÖĞ¶Ïº¯ÊıÖĞµÄ±äÁ¿ÇåÁã
	Èë¿Ú²ÎÊı£ºÎŞ
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£ºÍâ²¿ÖĞ¶Ïº¯ÊıÖĞµÄ±äÁ¿ÇåÁã
********************************************************************************************/
void Ps2_Out_Free(void)
{
	KeyV=0;
	Make_Code=0;									  //½ÓÊÕµ½µÄ¼üÅÌÂë£ºÍ¨Âë£¬¶ÏÂë0xF0£¬µÈµÈ£¨ÕâÀï½öÆğÁË¸öÍ¨ÂëMake_CodeµÄÃû×Ö¶øÒÑ£©
	isCode_F0=0;						  //¶ÏÂëµÚÒ»Î»Êı¾İ0xF0±£´æ
	Gain_New=0;
}
/********************************************************************************************
	º¯Êı¹¦ÄÜ£º»ñµÃ¼üÖµ
	Èë¿Ú²ÎÊı£ºÎŞ 
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£º»ñµÃ¼üÖµ
********************************************************************************************/
void Gain_Key_Data(void)
{
	if(Gain_New==1)										  //½ÓÊÕµ½ĞÂµÄ×Ö½ÚÊı¾İ£¬±êÖ¾Î»ÖÃ1
	{	if(Key_Up == 0)									  //ÅĞ¶Ï°´¼üÊÇ·ñÌ§Æğ£º0-Î´Ì§Æğ£»1-ÒÑÌ§Æğ
		{	if(isCode_F0 == 0xF0)	   					  //°´¼üÌ§ÆğÊ±
			{	
				isCode_F0=0;
				//relay_port =~relay_port;		  		  //µ÷ÊÔÓÃ
				//uart1_send_byte(0xF0);				  //µ÷ÊÔÓÃ
				Over_Flag = 1;
				BF=1;}									  //±íÊ¾½ÓÊÕÍê³ÉÒ»¸ö¼üÖµµÄÊı¾İ
		}	
		else
		{  
		   Gain_New=0;									  //Çå³ı±êÖ¾Î»£¬×¼±¸½ÓÊÕÏÂÒ»¸öÊı¾İ
		   //uart1_send_byte(Make_Code);					  //µ÷ÊÔÓÃ
		   Key_Data=Make_Code;							  //½«µÃµ½µÄÍ¨Âë±£´æÆğÀ´ËÍ¸øPassword_Inputº¯Êı£¨Ö®ºó
		   												  //Èç¹û¼ì²âµ½ËÉ¿ª¸Ã°´¼ü²¢ÇÒ¸Ã°´¼üÓĞĞ§£¬Ôò±£´æÎªÒ»Î»ÃÜÂë£©
		   Decode();// 								  	  //ÅĞ¶Ï¼üÖµÊÇ·ñÓĞĞ§£¬·äÃùÆ÷ÃùÉù
		   Key_Up=0;									  //±êÖ¾Î»ÇåÁã£¬µÈ´ıËÉ¿ª°´¼ü£¨¼´Ì§Æğ°´¼ü£©
		}
	}	   
	if(Over_Flag == 1)	    						      //Èç¹ûÊÇF0 ÔòÂËµôÊ£ÓàµÄ½áÊøÂë
	{
		delay_ms(10);									  //ÑÓÊ±Ê±¼ä±£Ö¤½áÊøÂëÒª´«µİÍêÁË
		Over_Flag = 0;
		Key_Up = 1;		    							  //È·¶¨Ì§ÊÖºó£¬ÖØĞÂ¿ªÊ¼×¼±¸½áÊøÓĞĞ§Âë
		Gain_New = 0;		      						  //±êÊ¶×Ö·û		
	}
}
/********************************************************************************************
	º¯Êı¹¦ÄÜ£ºÅĞ¶Ï¼üÖµÊÇ·ñÓĞĞ§£¬·äÃùÆ÷ÃùÉù
	Èë¿Ú²ÎÊı£ºÎŞ 
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£ºÅĞ¶Ï¼üÖµÊÇ·ñÓĞĞ§
			  »Ø³µ¼ü£ºÓÃÀ´È·¶¨ÊäÈë£¬ÊäÈëÃÜÂëºó±ØĞë°´ÏÂ»Ø³µ¼üÈ·ÈÏ¡£°´ÏÂ»Ø³µ¼üºó·äÃù2Éù£¨Ïì100ms¡¢Í£50ms¡¢Ïì100ms£©£»
			  »Ø¸ñ¼ü£º2¸ö°´¼ü¹¦ÄÜÏàÍ¬£¬ÓÃÀ´Çå³ıËùÓĞÊäÈë£¬°´ÏÂ°´¼ü·äÃù2Éù£¨Ïì100ms¡¢Í£50ms¡¢Ïì100ms£©£»
		 	  ÆäËû°´¼ü£ºÓÃÀ´±íÊ¾ÃÜÂë£¬°´ÏÂ°´¼ü·äÃù1Éù£¨100ms£©£»
********************************************************************************************/
void Decode(void)
{
	switch(Make_Code)									  //ÅĞ¶ÏÍ¨Âë
	{
		/*********************ÔËËã·û*******************************/
		case 0x79:								          //¼Ó·¨
		case 0x7B:								          //¼õ·¨
		case 0x7C:								          //³Ë·¨
		//case 0xE0 0x4A:						          //³ı·¨
		/*********************Ğ¡Êıµã*******************************/
		//case 0x49:								          //Ö÷¼üÅÌĞ¡Êıµã
		case 0x71:								          //Ğ¡¼üÅÌĞ¡Êıµã
		/*********************¿Õ¸ñ¼ü*******************************/
		case 0x29:
		/******************Ö÷¼üÅÌÊı×ÖÇø****************************/
		case 0x45:								          //Êı×Ö0
		case 0x16:								          //Êı×Ö1
		case 0x1E:								          //Êı×Ö2
		case 0x26:								          //Êı×Ö3
		case 0x25:								          //Êı×Ö4
		case 0x2E:								          //Êı×Ö5
		case 0x36:							   	          //Êı×Ö6
		case 0x3D:								          //Êı×Ö7
		case 0x3E:								          //Êı×Ö8
		case 0x46:								          //Êı×Ö9
		/******************Ğ¡¼üÅÌÊı×ÖÇø****************************/
		case 0x70:								          //Êı×Ö0
		case 0x69:								          //Êı×Ö1
		case 0x72:								          //Êı×Ö2
		case 0x7A:								          //Êı×Ö3
		case 0x6B:								          //Êı×Ö4
		case 0x73:								          //Êı×Ö5
		case 0x74:							   	          //Êı×Ö6
		case 0x6C:								          //Êı×Ö7
		case 0x75:								          //Êı×Ö8
		case 0x7D:								          //Êı×Ö9
		/******************×ÖÄ¸Çø******************************/
		case 0x1C:								          //×ÖÄ¸A
		case 0x32:								          //×ÖÄ¸B
		case 0x21:								          //×ÖÄ¸C
		case 0x23:								          //×ÖÄ¸D
		case 0x24:								          //×ÖÄ¸E
		case 0x2B:								          //×ÖÄ¸F
		case 0x34:								          //×ÖÄ¸G
		case 0x33:								          //×ÖÄ¸H
		case 0x43:								          //×ÖÄ¸I
		case 0x3B:								          //×ÖÄ¸J
		case 0x42:								          //×ÖÄ¸K
		case 0x4B:								          //×ÖÄ¸L
		case 0x3A:								          //×ÖÄ¸M
		case 0x31:								          //×ÖÄ¸N
		case 0x44:								          //×ÖÄ¸O
		case 0x4D:								          //×ÖÄ¸P
		case 0x15:								          //×ÖÄ¸Q
		case 0x2D:								          //×ÖÄ¸R
		case 0x1B:								          //×ÖÄ¸S
		case 0x2C:								          //×ÖÄ¸T
		case 0x3C:								          //×ÖÄ¸U		  
		case 0x2A:								          //×ÖÄ¸V		  
		case 0x1D:								          //×ÖÄ¸W		  
		case 0x22:								          //×ÖÄ¸X		  
		case 0x35:								          //×ÖÄ¸Y
		case 0x1A: Impactful_Key=1;Other_Beep();Make_Code=0;//	//·äÃùÆ÷¹¤×÷ //×ÖÄ¸Z
				 break;
		case 0x5A: Enter_Beep();Make_Code=0;	          //»Ø³µ¼ü
				 break;
		case 0x66:Backspace_Beep();Make_Code=0;           //»Ø¸ñ¼ü
		default:
				break;

	}
}
/********************************************************************************************
	º¯Êı¹¦ÄÜ£º½ÓÊÕ¡¢±£´æÃÜÂë¡¢½âÂëÊµÏÖÏàÓ¦µÄ¹¦ÄÜ
	Èë¿Ú²ÎÊı£º¼üÂëÊı¾İ-Í¨Âë
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£º½ÓÊÕ¡¢±£´æÃÜÂë¡¢½âÂëÊµÏÖÏàÓ¦µÄ¹¦ÄÜ
********************************************************************************************/
void Password_Input(uint8_t Password_One)  
{
	uint16_t i;
	uint16_t passWordNum;
	TR0=0;
	
	if(Password_One == 0x5A)	                          //ÊäÈëÃÜÂë½ÓÊÕÍê³É
	{	
		TR0=0;											  //¹Ø±Õ¶¨Ê±
		if(Config_Password_State != 0)				      //ÅĞ¶Ï³ÌĞòÊÇ·ñÔÚÅäÖÃÃÜÂë³ÌĞò×´Ì¬
		{					  
			if(Player_Input_Num >= 60)					  //Èç¹ûÉèÖÃµÄÃÜÂë´óÓÚ60Î»£¬Ôò±£´æÇ°60Î»
			{
				iap_erase_sector(IAP_ADDRESS);			  //²Á³ıµØÖ·Îª0x0000´óĞ¡Îª0.5K×Ö½ÚµÄÉÈÇø
				for(i=60;i<Player_Input_Num;i++)		  //Ò»¶¨ÒªÇå³ıÊäÈë60Î»Ö®ºóµÄ¼üÖµÊı¾İ£¬·ñÔò»áÓ°Ïìµ½ºóÃæÅĞ¶ÏÃÜÂëÊÇ·ñÒ»ÖÂµÄ³ÌĞò
				{
					Password_Buf[i]=0;				      //Ñ­»·Çå³ı60Î»Ö®ºóÃÜÂë»º³åÇøµÄÃ¿Ò»Î»Êı¾İ
				}
				Player_Input_Num=60;					  //Ïàµ±ÓÚ½ö½ÓÊÕµ½ÁËÇ°60Î»µÄÃÜÂëÊı¾İ
				for(i=0;i<Player_Input_Num;i++)			  //Ñ­»·°ÑÇ°60Î»Ã¿Ò»Î»ÃÜÂë±£´æÆğÀ´
				{ 
					Saved_Password_Buf[i]=Password_Buf[i];//½«ÊäÈëµÄÃÜÂë±£´æÆğÀ´
					iap_program_byte(IAP_ADDRESS+i+1, Saved_Password_Buf[i]); //¿ªÊ¼µÄµÚÒ»¸ö×Ö½ÚÎªÃÜÂëÊıÄ¿
				}	
			}
			else if(!Player_Input_Num)					  //Èç¹ûÉèÖÃµÄÃÜÂëÎª0Î»£¨ÃÜÂëÉèÖÃµÄÊ±ºòÖ±½Ó°´Enter£©£¬±£´æÔ­ÓĞµÄÃÜÂë
			{
				//relay_port =~relay_port;				  //µ÷ÊÔÓÃ
				Player_Input_Num=iap_read_byte(IAP_ADDRESS);//½«Ô­ÏÈ±£´æµÄÃÜÂëÊı¾İµÄ¸öÊıÈ¡³ö£¬ÔÚEEPROMµÄ0x0000µØÖ·µÄµÚÒ»¸ö×Ö½Ú
														    //Èç¹û²»È¡³öÔòÏàµ±ÓÚÊäÈëµÄÃÜÂëµÄ¸öÊıÊÇ0Î»£¬ÕâÑù¾Í²»ÄÜ±£´æÔ­ÓĞµÄÃÜÂëÁË
				if(Player_Input_Num >= 60)				  //µÚÒ»´ÎÉÏµçEEPROMµÄµÚÒ»¸ö×Ö½ÚÎªÎ´ÖªÊı¾İ£¬´ËÊ±Èç¹ûÉèÖÃÃÜÂëÎª0Î»£¬ÄÇÃ´Ïµ												
				{										  //Í³½«»áÎÉÂÒ£»½â¾ö´ëÊ©£ºÈç¹ûµÚÒ»×Ö½Ú´óÓÚ60Î»ÔòÇå0£¬Ïàµ±ÓÚÔ­ÏÈ±£´æµÄÃÜÂë
					Player_Input_Num=0;				      //µÄ¸öÊıÎª0¸ö£¬±£Ö¤ÏµÍ³²»»áÎÉÂÒ
				}
			}		   
			else
			{
				iap_erase_sector(IAP_ADDRESS);			  //²Á³ıµØÖ·Îª0x0000´óĞ¡Îª0.5K×Ö½ÚµÄÉÈÇø
				for(i=0;i<Player_Input_Num;i++)			  //Ñ­»·°ÑÃ¿Ò»Î»ÃÜÂë±£´æÆğÀ´
				{ 
					Saved_Password_Buf[i]=Password_Buf[i];//½«ÊäÈëµÄÃÜÂë±£´æÆğÀ´
					iap_program_byte(IAP_ADDRESS+i+1, Saved_Password_Buf[i]); //¿ªÊ¼µÄµÚÒ»¸ö×Ö½ÚÎªÃÜÂëÊıÄ¿
				}
			}
																  
			i=0;  
			Password_Size=Player_Input_Num;				  //µÃµ½ÊäÈëÃÜÂëµÄÎ»Êı
			iap_program_byte(IAP_ADDRESS, Password_Size); //½«ÃÜÂëÊıÄ¿Ğ´ÈëEEprom
			Finish_Config=1;							  //ÃÜÂëÅäÖÃÍê³É
			//relay_port =~relay_port;					  //µ÷ÊÔÓÃ
		}
		else											  //½ÓÊÕÃÜÂë½øĞĞ¿ªËøÉÏËø£»ÅĞ¶ÏÊÇ·ñ½øÈëÅäÖÃÃÜÂëÄ£Ê½
		{
			//relay_port =~relay_port;					  //µ÷ÊÔÓÃ
			passWordNum=iap_read_byte(IAP_ADDRESS);		  //»ñÈ¡ÃÜÂëÎ»Êı
			for(i=0;i<passWordNum;i++)
			{
				Read_Password_Buf[i]=iap_read_byte(IAP_ADDRESS+i+1);//´ÓEEPROMÖĞÈ¡³öÕıÈ·µÄÃÜÂëÊı¾İ
			}
			isTruePassWord=Password_Determine(&Password_Buf[0],&Read_Password_Buf[0],passWordNum); //²é¿´ÃÜÂëÊÇ·ñÕıÈ·	  Password_Size
			isTruePassWord_In30s=Password_Determine(&Password_Buf[0],&Administrator[0],12);  //ÉÏµç30sÄÚÊäÈëÊäÈëÅäÖÃÃÜÂë£ºsdam20160116£¬ÊäÈëÕıÈ·¿ÉÒÔÅäÖÃ
			if(isTruePassWord != 0)			 		      //²é¿´ÃÜÂëÊÇ·ñÕıÈ·
			{
				
				relay_port =~relay_port;				  //relay_port= 0Îª¿ªËø×´Ì¬
				
				music.folder_num= music.folder_num^0x0003;//Òì»òÔËËã£¬0x0101Òì»ò0x0003Îª0x0102,0x0102Òì»ò0x0003Îª0x0101£¬Òì»òÈ¡·´ÔËËã
				Play_Set_Sound(music.folder_num);		  //²¥·ÅÖ¸¶¨µÄÒôÀÖÎÄ¼ş
				Ps2_Out_Free();							  //½«ÖĞ¶Ï·şÎñº¯ÊıÖĞµÄ±äÁ¿ÇåÁã£¬ÒÔ×¼±¸½ÓÊÕÖ®ºóÊäÈëµÄ¼üÖµ
				
			}
			isIn_30s();									  //ÅĞ¶Ï¼ÆÊ±Ê±¼äÊÇ·ñµ½´ï30s
			if(!Finish_30s)							  	  //ÅĞ¶ÏÊÇ·ñÔÚ¿ªÊ¼µÄ30sÄÚ,·µ»ØÖµÎª0´ú±í»¹ÔÚ30sÄÚ£¬30sÄÚ¿ÉÒÔ½øÈëÅäÖÃÄ£Ê½	
			{
				TR0=1;									  //Æô¶¯¶¨Ê±Æ÷£¡Èç¹û¿ªÊ¼µÄ30sÄÚ£¬¹Ø±Õ¶¨Ê±Æ÷»áÓ°Ïì30sµÄ¼ÆÊ±£¨30s¼ÆÊ±ÓÃ¶¨Ê±Æ÷0£©
				//relay_port =~relay_port;				  //µ÷ÊÔÓÃ				
				if(isTruePassWord_In30s != 0)			 	  //²é¿´½øÈëÅäÖÃÄ£Ê½ÊäÈëµÄÃÜÂëÊÇ·ñÕıÈ·
				{
					//relay_port =~relay_port;			  //µ÷ÊÔÓÃ
					isTruePassWord_In30s=0;	      
					Allow_Set_Password=1;				  //½øÈëÃÜÂëÅäÖÃÄ£Ê½£¬ÉèÖÃÃÜÂë
				}
				else
				{Administrator_Ok=0;}					  //ÃÜÂë´íÎó
				Clean_Time0_Paramater();				  //ÇåÁã¼ÆÊ±µÄ²ÎÊı,·ÀÖ¹Ó°ÏìÏÂÒ»´Î¼ÆÊ±µÄ×¼È·ĞÔ
				Password_Free(0x3C);					  //60Î»ÃÜÂë¿Õ¼äÈ«²¿ÇåÁã£¨Çå³ı©
			}


		}		
		Password_Free(Player_Input_Num);				  //ÃÜÂëÊäÈëÍê³É£¬Çå¿ÕÃÜÂëÊäÈëµÄ»º³åÇø
		Start_10s=0;									  //¼ÆÊ±±êÖ¾Î»Çå0£¬Í£Ö¹¼ÆÊ±
		Player_Input_Num=0;								  //ÃÜÂëÊäÈë»º³åÇøÖĞÃÜÂëÊıÄ¿ÇåÁã
	}	
	else if((Password_One == 0x66)||(Password_One == 0x71))	  //Çå³ı¼üºÍ»Ø¸ñ¼ü£ºËùÓĞÊäÈëÇå³ı
	{
		Password_Free(Player_Input_Num);				  //Çå¿ÕÃÜÂëÊäÈëµÄ»º³åÇø
		TR0=1;											  //Æô¶¯¶¨Ê±Æ÷£¡Èç¹û¿ªÊ¼µÄ30sÄÚ£¬¹Ø±Õ¶¨Ê±Æ÷»áÓ°Ïì30sµÄ¼ÆÊ±£¨30s¼ÆÊ±ÓÃ¶¨Ê±Æ÷0£©
		Start_10s=0;									  //Ò»¸ö10sÅĞ¶Ï±êÖ¾Î»£ºÈç¹û10sÄÚÃ»ÓĞÆäËûÃÜÂëÊäÈëÔòÇå¿ÕÒÑÊäÈëµÄÃÜÂë£ºÆô¶¯¼ÆÊ±
		Clean_Time0_Paramater();						  //ÇåÁã¼ÆÊ±µÄ²ÎÊı
		Player_Input_Num=0;								  //ÃÜÂëÊäÈë»º³åÇøÖĞÃÜÂëÊıÄ¿ÇåÁã
	}
	else
	{
		if(Impactful_Key != 0)							  //ÅĞ¶Ï°´¼üÊÇ·ñÊÇÓĞĞ§°´¼ü£¬ÎŞĞ§Ôò²»¼ÇÂ¼ÎªÊäÈëµÄÃÜÂë
		{
			if(Password_One == 0x70){Password_One=0x45;}  //Ğ¡¼üÅÌÊı×Ö0ºÍÖ÷¼üÅÌÊı×Ö0µÈĞ§
			if(Password_One == 0x69){Password_One=0x16;}  //Ğ¡¼üÅÌÊı×Ö1ºÍÖ÷¼üÅÌÊı×Ö1µÈĞ§
			if(Password_One == 0x72){Password_One=0x1E;}  //Ğ¡¼üÅÌÊı×Ö2ºÍÖ÷¼üÅÌÊı×Ö2µÈĞ§
			if(Password_One == 0x7A){Password_One=0x26;}  //Ğ¡¼üÅÌÊı×Ö3ºÍÖ÷¼üÅÌÊı×Ö3µÈĞ§
			if(Password_One == 0x6B){Password_One=0x25;}  //Ğ¡¼üÅÌÊı×Ö4ºÍÖ÷¼üÅÌÊı×Ö4µÈĞ§
			if(Password_One == 0x73){Password_One=0x2E;}  //Ğ¡¼üÅÌÊı×Ö5ºÍÖ÷¼üÅÌÊı×Ö5µÈĞ§
			if(Password_One == 0x74){Password_One=0x36;}  //Ğ¡¼üÅÌÊı×Ö6ºÍÖ÷¼üÅÌÊı×Ö6µÈĞ§
			if(Password_One == 0x6C){Password_One=0x3D;}  //Ğ¡¼üÅÌÊı×Ö7ºÍÖ÷¼üÅÌÊı×Ö7µÈĞ§
			if(Password_One == 0x75){Password_One=0x3E;}  //Ğ¡¼üÅÌÊı×Ö8ºÍÖ÷¼üÅÌÊı×Ö8µÈĞ§
			if(Password_One == 0x7D){Password_One=0x46;}  //Ğ¡¼üÅÌÊı×Ö9ºÍÖ÷¼üÅÌÊı×Ö9µÈĞ§

			Password_Save(Password_One,Player_Input_Num); //±£´æÃÜÂë
			Player_Input_Num++;
			if(Player_Input_Num>=70)					  //ÃÜÂë²»µÃ³¬¹ıÁùÊ®Î»
			{
				Player_Input_Num=0x46;
				//Password_Free(0x3C);					  //60Î»ÃÜÂë¿Õ¼äÈ«²¿ÇåÁã£¨Çå³ı£©
				//relay_port =~relay_port;				  //µ÷ÊÔÓÃ
			}	
			Clean_Time0_Paramater();					  //ÇåÁã¼ÆÊ±µÄ²ÎÊı,ÖØĞÂ¼ÆÊ±
			TR0=1;										  //Æô¶¯¶¨Ê±Æ÷
			Start_10s=1;								  //Ò»¸ö10sÅĞ¶Ï±êÖ¾Î»£ºÈç¹û10sÄÚÃ»ÓĞÆäËûÃÜÂëÊäÈëÔòÇå¿ÕÒÑÊäÈëµÄÃÜÂë	
			Impactful_Key=0;							  //·ÀÖ¹ÏÂÒ»¸ö·ÇÓĞĞ§°´¼ü±»ÎóÈÏÎªÊÇÓĞĞ§
		}		
	}	
}

/********************************************************************************************
	º¯Êı¹¦ÄÜ£ºÅĞ¶ÏÁ¬ĞøµÄ10ÃëÄÚÊÇ·ñÓĞÊäÈë
	Èë¿Ú²ÎÊı£ºÎŞ
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£ºµ±ÓÎÏ·Íæ¼Ò¿ªÊ¼ÊäÈëÃÜÂë£¬ÅĞ¶ÏÁ¬Ğø10ÃëÊÇ·ñÓĞÊäÈë£»ÈôÃ»ÓĞÔòÇå³ıËùÓĞÊäÈë×´Ì¬
********************************************************************************************/
void Determine_10s(void)
{
	if((Key_Data != 0)&&(Start_10s != 0))	      //ÓĞÃÜÂëÊäÈë²¢ÇÒÆô¶¯10s¼ÆÊ±
	{
		if(timer0_10s() != 0)	   						  //Èç¹ûÎª1£¬´ú±í10s¼ÆÊ±Íê³ÉËµÃ÷Á¬Ğø10sÃ»ÓĞÊäÈë
		{
			Password_Free(0x3C);					      //60Î»ÃÜÂë¿Õ¼äÈ«²¿ÇåÁã£¨Çå³ı£©
			//relay_port =~relay_port;					  //µ÷ÊÔÓÃ
			Start_10s=0;								  //Çå³ı±êÖ¾Î»
			Player_Input_Num=0;							  //ÃÜÂëÊäÈë»º³åÇøÖĞÃÜÂëÊıÄ¿ÇåÁã
		}
	} 
}
/********************************************************************************************
	º¯Êı¹¦ÄÜ£ºÅĞ¶Ï¼ÆÊ±Ê±¼äÊÇ·ñµ½´ï30s
	Èë¿Ú²ÎÊı£ºÎŞ
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£ºÅĞ¶Ï¼ÆÊ±Ê±¼äÊÇ·ñµ½´ï30s£¬µ½´ï30sÔò½«±êÖ¾Î»ËÀËø×¡
********************************************************************************************/
void isIn_30s(void)
{										
	if(!Finish_30s)										  //·µ»ØÖµÎª0±íÊ¾ÏÖÔÚÎ´µ½30s£¬Ôò½øÈëÅĞ¶ÏÊÇ·ñÊÇ·ñ¼ÆÊ±Íê±Ï£»·ñÔò±íÊ¾¼ÆÊ±Íê±Ï
	{
		Finish_30s=timer0_30s();						  //½ÓÊÕ·µ»ØÖµ
	}
}					   
/********************************************************************************************
	º¯Êı¹¦ÄÜ£º½øÈëÃÜÂëÅäÖÃÄ£Ê½£¬ÓÉÍæ¼ÒÉè¶¨ÅäÖÃµÄÃÜÂë
	Èë¿Ú²ÎÊı£ºÎŞ
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£ºÉèÖÃÃÜÂë
********************************************************************************************/
void Player_Set_Password(void)
{
	if(Allow_Set_Password)
	{
		Allow_Set_Password=0;
		Play_Set_Sound(0x0202);						      //²¥·ÅÖ¸¶¨µÄÒôÀÖÎÄ¼ş
		Ps2_Out_Free();									  //½«ÖĞ¶Ï·şÎñº¯ÊıÖĞµÄ±äÁ¿ÇåÁã£¬ÒÔ×¼±¸½ÓÊÕÖ®ºóÊäÈëµÄ¼üÖµ
		while(!Finish_Config)
		{
			Config_Password_State=1;
			Send_Analysis();							  //µ÷ÓÃ²Ù×÷º¯Êı£¨½ÓÊÕ¡¢±£´æÃÜÂë¡¢½âÂëÊµÏÖÏàÓ¦µÄ¹¦ÄÜ£©
			//Decode();									  //ÅĞ¶Ï¼üÖµÊÇ·ñÓĞĞ§	·äÃùÆ÷¹¤×÷
			Gain_Key_Data();
	
		}
		Config_Password_State=0;						  //Ìø³öÃÜÂëÅäÖÃÄ£Ê½
		Play_Set_Sound(0x0203);						      //²¥·ÅÖ¸¶¨µÄÒôÀÖÎÄ¼ş
		Ps2_Out_Free();									  //½«ÖĞ¶Ï·şÎñº¯ÊıÖĞµÄ±äÁ¿ÇåÁã£¬ÒÔ×¼±¸½ÓÊÕÖ®ºóÊäÈëµÄ¼üÖµ
		Password_Free(0x3C);							  //60Î»ÃÜÂë¿Õ¼äÈ«²¿ÇåÁã£¨Çå³ı£©
	}	
}
/********************************************************************************************
	º¯Êı¹¦ÄÜ£ºÃÜÂëÊıÖµÅĞ¶ÏÊÇ·ñÒ»ÖÂ
	Èë¿Ú²ÎÊı£ºÍæ¼ÒÊäÈëÍê³ÉµÄÃÜÂë--Player_Password£»ÉèÖÃºÃµÄÃÜÂë--Fix_Password£»ÃÜÂëµÄÊıÄ¿
	·µ»Ø²ÎÊı£º1--ÃÜÂëÒ»ÖÂ£»0--ÃÜÂë²»Ò»ÖÂ¡£
	º¯ÊıËµÃ÷£ºÃÜÂëÊıÖµÅĞ¶ÏÊÇ·ñÒ»ÖÂ£¬ÅĞ¶ÏÊäÈëµÄÃÜÂëÊÇ·ñÓëÉèÖÃºÃµÄ
			  ÃÜÂëÒ»ÖÂ£¬Ò»ÖÂµÄ»°·µ»Ø1£¬²»Ò»ÖÂ·µ»Ø0
********************************************************************************************/
uint8_t Password_Determine(uint8_t *Player_Password, uint8_t *Fix_Password,uint8_t Num)
{
	uint8_t i=0;
	uint8_t j=0;
	for(i=0;i<Num;i++)
	{  
		if(*(Player_Password+j)==*(Fix_Password+j))
		{
			j++;
			if((j>=Num)&&(!(*(Player_Password+j))))		  //Èç¹ûÃÜÂëÍêÈ«Ò»ÖÂ£¨NumÎ»µÄÃÜÂëÒ»ÖÂ²¢ÇÒÖ®ºóÍæ¼ÒÃ»ÓĞ¼ÌĞøÊäÈëÃÜÂë£©
			{
				i=0;
				j=0;
				return 1;								  //·µ»Ø1´ú±íÊäÈëµÄÃÜÂëºÍÕıÈ·µÄÃÜÂëÒ»ÖÂ
			}
		}
		else
		{i=0;j=0;return 0;}								  //·µ»Ø0´ú±íÊäÈëµÄÃÜÂëºÍÕıÈ·µÄÃÜÂë²»Ò»ÖÂ
	}
	i=0;j=0;return 0;
}

/********************************************************************************************
	º¯Êı¹¦ÄÜ£ºÃÜÂëÇå¿Õº¯Êı
	Èë¿Ú²ÎÊı£ºÇå³ı»º³åÇøÎ»ÊıÊıÄ¿
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£º¶ÔÍæ¼ÒÊäÈëµÄÃÜÂëÇå³ı¡£
********************************************************************************************/
void Password_Free(uint8_t Num)
{
	uint8_t i;
	for(i=0;i<Num;i++)
	{
		Password_Buf[i]=0;								  //Ñ­»·Çå³ıÃÜÂë»º³åÇøµÄÃ¿Ò»Î»Êı¾İ
	}
}
/********************************************************************************************
	º¯Êı¹¦ÄÜ£ºÃÜÂë±£´æº¯Êı
	Èë¿Ú²ÎÊı£ºÍæ¼ÒÒ»¸ö¼üÖµÃÜÂëÊı¾İ£»±£´æÔÚ»º³åÇøµÄÎ»ÖÃ×ø±ê
	·µ»Ø²ÎÊı£ºÎŞ
	º¯ÊıËµÃ÷£º½«Íæ¼ÒÊäÈëµÄÃÜÂë½øĞĞ´æ´¢
********************************************************************************************/
void Password_Save(uint8_t Player_Password,uint8_t i)
{
	Password_Buf[i]=Player_Password;					  //½«µÃµ½µÄ¼üÖµÊı¾İ±£´æµ½»º³åÇø
}


