/**********************************************************************************
	文件: WS2811drive.c
	作者: WillJason
	版本：V1.0
	日期：2016年5月30日
	备注：这个文件提供了基于WS2811芯片的全彩LED灯带的基本驱动函数   	   
***********************************************************************************/
#include "STC12C5A60S2.h"
#include "WS2811drive.h"
#include "io_config.h"
#include <intrins.h>


/*****************************************************************************************************
 - 功能描述： WS2811芯片写入逻辑0函数
 - 入口参数： 无
 - 出口参数： 无
 - 函数说明： 高速模式	    
*****************************************************************************************************/

void WS2811_Bit0()
{
	LED_DatPort = 1;
	_nop_();
	LED_DatPort = 0;
	_nop_();
}

/*****************************************************************************************************
 - 功能描述： WS2811芯片写入逻辑1函数
 - 入口参数： 无
 - 出口参数： 无
 - 函数说明： 高速模式	    
*****************************************************************************************************/

void WS2811_Bit1()
{
	LED_DatPort = 1;
	_nop_();
	_nop_();
	LED_DatPort = 0;

}

/*****************************************************************************************************
 - 功能描述： WS2811单字节数据写入函数
 - 入口参数： 要写入的数据字节
 - 出口参数： 无
 - 函数说明： 高速模式	    
*****************************************************************************************************/

void WS2811_SendByte(unsigned char dat)
{
	if(dat & 0x80)
		WS2811_Bit1();
	else
		WS2811_Bit0();
	if(dat & 0x40)
		WS2811_Bit1();
	else
		WS2811_Bit0();
	if(dat & 0x20)
		WS2811_Bit1();
	else
		WS2811_Bit0();
	if(dat & 0x10)
		WS2811_Bit1();
	else
		WS2811_Bit0();
	if(dat & 0x08)
		WS2811_Bit1();
	else
		WS2811_Bit0();
	if(dat & 0x04)
		WS2811_Bit1();
	else
		WS2811_Bit0();
	if(dat & 0x02)
		WS2811_Bit1();
	else
		WS2811_Bit0();
	if(dat & 0x01)
		WS2811_Bit1();
	else
		WS2811_Bit0();
}


/******************************************************************************************************
 函数功能：向WS2811发送一串数据                 
 入口参数：R:红色的灰度级参数G:绿色B:蓝色    
           led_size:要点亮的灯的级数			 
 返回参数：None                                 
 函数说明：                                     
******************************************************************************************************/
void WS2811_SendString(uint8_t  R,uint8_t  G,uint8_t  B, uint16_t led_size)
{
	uint8_t i;
	if(led_size != 0)
	{
		for(i = 0;i < led_size;i++)
		{
			WS2811_SendByte(B);
			WS2811_SendByte(R);		 
			WS2811_SendByte(G);
		}
	 }
	 WS2811_SendByte(0);
	 WS2811_SendByte(0);
	 WS2811_SendByte(0);
	 WS2811_SendByte(0);
	 WS2811_SendByte(0);
	 WS2811_SendByte(0);

}