#ifndef  __I2C_H
#define __I2C_H

#ifdef  I2C_GLOBALES
#define I2C_EXT
#else 
#define I2C_EXT extern
#endif

//I2C_EXT uint8 idata MAX7321_PC;     //输出寄存器漏极开路
//I2C_EXT uint8 idata MAX7321_DP;     //输出寄存器漏极开路

#define  SMB_FREQUENCY  200000                 //SMBUS目标时钟频率 原50000现改为40000好用了	  200000为200KHZ；

#define	ONE_BYTE_SUBA	1    //子地址是单字节结构
//#define     TWO_BYTE_SUBA	2   //子地址是双字节结构
//#define     X_ADD_8_SUBA	3   //子地址是8＋X结构
//---------------------------------------------//
//TMP512AIRSA
//MAX 400KHz
#define   TMP512AIRSA    0x98                 // 地址
#define   TMP102         0x9C

//---------------------------------------------//
//---------------------------------------------//
//max7321aee
//MAX 400KHz
//#define   MAX7321AEE_ADDR_PC    0xDA                // 地址 初始上电端口为高电平 开漏输出
//#define   MAX7321AEE_ADDR_DP    0xD2                // 地址 初始上电端口为高电平 开漏输出

//---------------------------------------------//
/*******************************************************************************
函数功能:SMBUS初始化
*******************************************************************************/
extern void I2c_Init (void);

/*
**********************************************************************************************************
** 函数名称：I2C_ByteWrite()
** 函数功能：向无子地址器件发送字节数据。
** 入口参数：target_addr		器件地址
**               dat		                要发送的数据
**               len                          发送的数据长度
** 出口参数：
** 说明：	
*********************************************************************************************************
*/
extern void I2c_WriteByte(uint8 target_addr, uint8* src_addr,uint8 len);

/*
*********************************************************************************************************
** 函数名称：I2C_ByteRead()
** 函数功能：向无子地址器件读取字节数据。
** 入口参数：target_addr	器件地址
**               len                  读的数据长度
** 出口参数：
** 说明：
*********************************************************************************************************
*/
extern void I2c_ReadByte(uint8 target_addr, uint8* dst_addr,uint8 len);

/*
*********************************************************************************************************
** 函数名称 I2C_WriteSubByte()
** 函数功能 ：从有子地址器件任意地址开始读取N字节数据
** 入口参数 ：		target_addr		器件从地址
**				suba_type	 子地址结构	1－单字节地址	3－8+X结构	2－双字节地址
**				suba		 器件子地址
**				src_addr			数据接收缓冲区指针
**				len			读取的个数
** 出口参数 ：	
**				
*********************************************************************************************************
*/
extern void I2c_WriteSubByte (uint8 target_addr, uint8 suba_type, uint16 suba, uint8* src_addr,
                        uint8 len);

/*
*********************************************************************************************************
** 函数名称 I2c_ReadSubByte()
** 函数功能 ：从有子地址器件任意地址开始读取N字节数据
** 入口参数 ：	target_addr			器件从地址
**				suba_type	子地址结构	1－单字节地址	2－8+X结构	2－双字节地址
**				suba		器件子地址
**				scr_addr			数据接收缓冲区指针
**				len			读取的个数
** 出口参数 ：	
**				
*********************************************************************************************************
*/
extern void I2c_ReadSubByte (uint8 target_addr, uint8 suba_type, uint16 suba, uint8* scr_addr,
                       uint8 len);


#endif
